[2021-01-01 02:00:02] START

     .----------------.
    |   Raspberry Pi   |
    |      Pico W      |
    |  .------------.  |
    |  | [] [] [] []|  |
    |  | [] [] [] []|  |
    |  '------------'  |
    |__________________|
      |  ||      ||  |
      |  ||      ||  |
      '--------------'

[2021-01-01 02:00:02] Attempting to connect to WiFi using the following config:
SSID: ASUS, PASSWORD: Framogtilbakeerlikelangt

pico-w> [2021-01-01 02:00:06] Initial WiFi connection failed.

pico-w> [2021-01-01 02:00:07] WiFi disconnected. Attempting reconnection...

pico-w> [2021-01-01 02:00:11] Reconnection attempt failed. Trying again in 30 seconds
help

Help menu:
-------------------------
info                    Shows info about the system
config                  Shows contents of config.json
url=<url>               Changes URL in config.json to <url>
ssid=<ssid>             Changes SSID in config.json to <ssid>
password=<pwd>          Changes PASSWORD in config.json to <pwd>
restart                 Restarts the pico
version                 Shows current version

pico-w> ssid=dlink
Old SSID: ASUS
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:00:41] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:00:45] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:01:15] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:01:19] Reconnection attempt failed. Trying again in 30 seconds

pico-w> password=[2021-01-01 02:01:49] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:01:53] Reconnection attempt failed. Trying again in 30 seconds
4jXb38Nz9o8yT3
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> password=4jXb38Nz9o8yT3
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> pa[2021-01-01 02:02:24] WiFi disconnected. Attempting reconnection...

pico-w> [2021-01-01 02:02:28] Reconnection attempt failed. Trying again in 30 seconds
p
pico-w>
pico-w>
pico-w>
pico-w> passe
pico-w> password=4jXb38Nz9o8y[2021-01-01 02:02:58] WiFi disconnected. Attempting reconnection...
T3
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:03:02] Reconnection attempt failed. Trying again in 30 seconds

pico-w>
pico-w>
pico-w> help

Help menu:
-------------------------
info                    Shows info about the system
config                  Shows contents of config.json
url=<url>               Changes URL in config.json to <url>
ssid=<ssid>             Changes SSID in config.json to <ssid>
password=<pwd>          Changes PASSWORD in config.json to <pwd>
restart                 Restarts the pico
version                 Shows current version

pico-w> p[2021-01-01 02:03:32] WiFi disconnected. Attempting reconnection...
ass
pico-w> [2021-01-01 02:03:36] Reconnection attempt failed. Trying again in 30 seconds

pico-w>
pico-w>
pico-w> password=wwww
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:04:06] WiFi disconnected. Attempting reconnection...
p
pico-w>
pico-w> [2021-01-01 02:04:10] Reconnection attempt failed. Trying again in 30 seconds
ssid = ASUS
pico-w>
pico-w>
pico-w>
pico-w> infi
pico-w> info

=== WiFi Connection ===
Pico IP Address:             not connected

=== SENSORS ===
Temperature : 28.15099
Humidity    : 50.02136
CO2         : 694.9253

=== WATERLEVEL ===
NorthEast   : 75
SouthWest   : 25

=== VALVES ===
NorthEast
  Duration valve was open  : 0
  Status                   : closed
  Last opened              : 0
  Last closed              : 0
SouthWest
  Duration valve was open  : 0
  Status                   : open
  Last opened              : 1609466407
  Last closed              : 0

pico-w> [2021-01-01 02:04:41] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:04:45] Reconnection attempt failed. Trying again in 30 seconds

pico-w>
pico-w>
pico-w> ssid
pico-w> helpÃ¥
pico-w> help

Help menu:
-------------------------
info                    Shows info about the system
config                  Shows contents of config.json
url=<url>               Changes URL in config.json to <url>
ssid=<ssid>             Changes SSID in config.json to <ssid>
password=<pwd>          Changes PASSWORD in config.json to <pwd>
restart                 Restarts the pico
version                 Shows current version

pico-w> con[2021-01-01 02:05:15] WiFi disconnected. Attempting reconnection...
fig

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      dlink
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:05:19] Reconnection attempt failed. Trying again in 30 seconds

pico-w> ssid=ASUS
Old SSID: dlink
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      ASUS
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:00:02] START

     .----------------.
    |   Raspberry Pi   |
    |      Pico W      |
    |  .------------.  |
    |  | [] [] [] []|  |
    |  | [] [] [] []|  |
    |  '------------'  |
    |__________________|
      |  ||      ||  |
      |  ||      ||  |
      '--------------'

[2021-01-01 02:00:02] Attempting to connect to WiFi using the following config:
SSID: ASUS, PASSWORD: Framogtilbakeerlikelangt
[2021-01-01 02:00:07] Initial WiFi connection failed.

pico-w> [2021-01-01 02:00:07] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:00:11] Reconnection attempt failed. Trying again in 30 seconds

pico-w> info

=== WiFi Connection ===
Pico IP Address:             not connected

=== SENSORS ===
Temperature : 27.68368
Humidity    : 52.05841
CO2         : 766.3443

=== WATERLEVEL ===
NorthEast   : 50
SouthWest   : 25

=== VALVES ===
NorthEast
  Duration valve was open  : 0
  Status                   : closed
  Last opened              : 0
  Last closed              : 0
SouthWest
  Duration valve was open  : 0
  Status                   : open
  Last opened              : 1609466407
  Last closed              : 0

pico-w> [2021-01-01 02:00:41] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:00:45] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:01:15] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:01:19] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:01:49] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:01:54] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:02:24] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:02:28] Reconnection attempt failed. Trying again in 30 seconds

pico-w>
pico-w> info

=== WiFi Connection ===
Pico IP Address:             not connected

=== SENSORS ===
Temperature : 28.16434
Humidity    : 50.26093
CO2         : 561.1492

=== WATERLEVEL ===
NorthEast   : 100
SouthWest   : 25

=== VALVES ===
NorthEast
  Duration valve was open  : 0
  Status                   : closed
  Last opened              : 0
  Last closed              : 0
SouthWest
  Duration valve was open  : 0
  Status                   : open
  Last opened              : 1609466407
  Last closed              : 0

pico-w> [2021-01-01 02:02:58] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:03:02] Reconnection attempt failed. Trying again in 30 seconds

pico-w> info

=== WiFi Connection ===
Pico IP Address:             not connected

=== SENSORS ===
Temperature : 28.26315
Humidity    : 50.76752
CO2         : 639.4922

=== WATERLEVEL ===
NorthEast   : 100
SouthWest   : 50

=== VALVES ===
NorthEast
  Duration valve was open  : 0
  Status                   : closed
  Last opened              : 0
  Last closed              : 0
SouthWest
  Duration valve was open  : 0
  Status                   : open
  Last opened              : 1609466407
  Last closed              : 0

pico-w> [2021-01-01 02:03:32] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:03:36] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:03:42] Closing SouthWest valve
[2021-01-01 02:04:06] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:04:10] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:04:41] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:04:45] Reconnection attempt failed. Trying again in 30 seconds
[2021-01-01 02:05:15] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:05:19] Reconnection attempt failed. Trying again in 30 seconds

pico-w> password=ddd
Updated config:



=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      ASUS
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w> [2021-01-01 02:05:49] WiFi disconnected. Attempting reconnection...
[2021-01-01 02:05:53] Reconnection attempt failed. Trying again in 30 seconds

pico-w>
pico-w>
pico-w> password="rrr"
Updated config:

=== CONFIGURATION ===
Version:        0.2
WiFi SSID:      ASUS
WiFi PASS:      Framogtilbakeerlikelangt
Post URL:       https://midtskips.no/drivhus/api/waterlevel/

pico-w>
